// Напишите программу, которая по заданному номеру четверти,
// показывает диапазон возможных координат точек в этой четверти (x и y).

using static System.Console ;
Clear() ;
Write(" Введите номер четверти координат точки  ");
int quarter=Convert.ToInt16(ReadLine()) ;

if(quarter==1)
{
   WriteLine(" координата точки  X ->  от [0 до + бесконечночти) ") ;
   WriteLine(" координата точки  Y ->  от [0 до + бесконечночти) ") ;  
}
if( quarter==2)
{
    WriteLine(" координата точки  X ->  от (0 до - бесконечночти) ") ;
    WriteLine(" координата точки  Y ->  от (0 до + бесконечночти) ") ; 
}
if(quarter==3 )
{
    WriteLine(" координата точки  X ->  от (0 до - бесконечночти) ") ;
    WriteLine(" координата точки  Y ->  от (0 до - бесконечночти) ") ; 
}
if(quarter==4)
{
    WriteLine(" координата точки  X ->  от (0 до + бесконечночти) ") ;
    WriteLine(" координата точки  Y ->  от (0 до - бесконечночти) ") ; 
}